
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьИзображениеКарты", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзображениеКарты()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьИзображениеКартыНаСервере(ТекущиеДанные.Card);	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзображениеКартыНаСервере(Card)
		
	CardImagesRecordManager = InformationRegisters.CardImages.CreateRecordManager();
	CardImagesRecordManager.Card = Card;
	
	CardImagesRecordManager.Read();
	
	CardImageData = CardImagesRecordManager.Image.Get();
	CardImage = ПоместитьВоВременноеХранилище(CardImageData, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры
