
&НаКлиенте
Процедура ПолучитьСписокСетов(Команда)
	
	ПолучитьСписокСетовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокСетовНаСервере()
	
	InformationRegisters.SetList.UpdateData();
	
	ОбновитьСписокВыбораСетов();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьВыбранныйСетНаСервере(ВыбранныйСет, GetExtra)
	
	Set = Справочники.Sets.НайтиПоКоду(ВыбранныйСет, Истина);
	
	If Set.IsEmpty() Then
		Set = Справочники.Sets.СоздатьЭлемент();
		Set.Code = ВыбранныйСет;
		Set.Description = "temp";
		Set.Write();
	Else
		Set = Set.GetObject();
	EndIf;
	
	Set.UpdateData(GetExtra);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыбранныйСет(Команда)
	ЗагрузитьВыбранныйСетНаСервере(ВыбранныйСет, GetExtra);
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.Cards"));
	ОповеститьОбИзменении(Тип("СправочникСсылка.Sets"));
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.SetBoosterComposition"));

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписокВыбораСетов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокВыбораСетов()
	
	ВыбранныйСет = "";
	Элементы.ВыбранныйСет.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	SetList.SetCode,
	|	SetList.SetName,
	|	SetList.ReleaseDate КАК ReleaseDate
	|ИЗ
	|	РегистрСведений.SetList КАК SetList
	|
	|УПОРЯДОЧИТЬ ПО
	|	ReleaseDate УБЫВ";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Элементы.ВыбранныйСет.СписокВыбора.Добавить(Выборка.SetCode, Выборка.SetCode + " - " + Выборка.SetName + " (" + Формат(Выборка.ReleaseDate, "ДЛФ=D") + ")");	
	КонецЦикла;
	
КонецПроцедуры // ОбновитьСписокВыбораСетов()

