
&НаКлиенте
Процедура ПолучитьСписокСетов(Команда)
	
	ПолучитьСписокСетовНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокСетовНаСервере()
	
	SetListData = MTGJSON.GetMTGData("SetList.json");
	
	ВыбранныйСет = "";
	Элементы.ВыбранныйСет.СписокВыбора.Очистить();
	
	For Each Set In SetListData Do
		SetName = Set.Get("name");
		SetCode = Set.Get("code");
		Элементы.ВыбранныйСет.СписокВыбора.Добавить(SetCode, SetCode + " - " + SetName);
	EndDo;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьВыбранныйСетНаСервере(ВыбранныйСет)
	
	Set = Справочники.Sets.НайтиПоКоду(ВыбранныйСет, Истина);
	
	If Set.IsEmpty() Then
		Set = Справочники.Sets.СоздатьЭлемент();
		Set.Code = ВыбранныйСет;
		Set.Description = "temp";
		Set.Write();
	Else
		Set = Set.GetObject();
	EndIf;
	
	Set.UpdateData();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыбранныйСет(Команда)
	ЗагрузитьВыбранныйСетНаСервере(ВыбранныйСет);
КонецПроцедуры
